In [1]:
#Importing and Reading Data
import pandas
train_data = "https://www.kaggle.com/c/titanic/download/train.csv"
test_data = "https://www.kaggle.com/c/titanic/download/test.csv"
ds = pandas.read_csv('train.csv')
ds.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [2]:
#Data Cleaning
ds = ds.drop(['Name','Ticket','PassengerId'],1)
ds.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Cabin Embarked
0         0       3    male  22.0      1      0   7.2500   NaN        S
1         1       1  female  38.0      1      0  71.2833   C85        C
2         1       3  female  26.0      0      0   7.9250   NaN        S
3         1       1  female  35.0      1      0  53.1000  C123        S
4         0       3    male  35.0      0      0   8.0500   NaN        S

In [3]:
Missing_Ages = sum(ds['Age'].isnull()) 
Missing_Cabin = sum(ds['Cabin'].isnull())
#features.shape()
print "Total Entries", len(ds.index)
print "Missing ages information", Missing_Ages
print "Missing cabin information", Missing_Cabin

Total Entries 891
Missing ages information 177
Missing cabin information 687

In [4]:
#dropping Cabin because most entries for cabin value are missing
ds = ds.drop('Cabin',1)
ds.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

In [5]:
#Dropping all rows with any NA value with dropna
ds = ds.dropna()
print "Total number of rows left",len(ds.index)
ds.head()

Total number of rows left 712

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

In [6]:
ds.shape

(712, 8)

In [7]:
labels = ds['Survived']
features = ds.drop('Survived',1)
#features['Sex'] = features['Sex'].astype('category')
#features['Embarked'] = features['Embarked'].astype('category')
from sklearn import preprocessing
le = preprocessing.LabelEncoder()
le1 = le.fit(["male","female"])
features['Sex'] = le1.transform(features['Sex'])
le2 = le.fit(['S','C','Q'])
features['Embarked'] = le2.transform(features['Embarked'])
features.dtypes

Pclass        int64
Sex           int64
Age         float64
SibSp         int64
Parch         int64
Fare        float64
Embarked      int64
dtype: object

In [8]:
#OneHotEncoder should be used to handle categories
#But Right now we were drop this column to not work on OneHotEncoder
#from sklearn.preprocessing import OneHotEncoder
features = features.drop('Embarked',1)

In [10]:
#Separating Cross Validation Set
from sklearn.model_selection import train_test_split

features_train, features_test, labels_train, labels_test = train_test_split(features, labels, test_size=0.4, random_state=0)
features_train.head(),labels_train.head()

(     Pclass  Sex   Age  SibSp  Parch    Fare
 167       3    0  45.0      1      4  27.900
 579       3    1  32.0      0      0   7.925
 279       3    0  35.0      1      1  20.250
 728       2    1  25.0      1      0  26.000
 131       3    1  20.0      0      0   7.050, 167    0
 579    1
 279    1
 728    0
 131    0
 Name: Survived, dtype: int64)

In [11]:
#Logistic Regression Classifier
from sklearn import linear_model
logreg = linear_model.LogisticRegression()
logreg = logreg.fit(features_train,labels_train)
print logreg.score(features_train,labels_train)
print logreg.score(features_test,labels_test)

0.810304449649
0.778947368421

In [12]:
#Decision Tree Classifier
from sklearn import tree
dectree = tree.DecisionTreeClassifier()
dectree = dectree.fit(features_train,labels_train)
print dectree.score(features_train,labels_train)
print dectree.score(features_test,labels_test)

0.992974238876
0.764912280702

In [13]:
#Support Vector Machine Classifier
from sklearn import svm
svmclass = svm.SVC()
svmclass = svmclass.fit(features_train,labels_train)
print svmclass.score(features_train,labels_train)
print svmclass.score(features_test,labels_test)

0.918032786885
0.617543859649

In [14]:
#Neural Network Classifier
from sklearn.neural_network import MLPClassifier
clf = MLPClassifier(solver='lbfgs', alpha=1e-5,hidden_layer_sizes=(5, 2), random_state=1)
clf = clf.fit(features_train,labels_train)
print clf.score(features_train,labels_train)
print clf.score(features_test,labels_test)

0.697892271663
0.666666666667

In [15]:
from sklearn.naive_bayes import GaussianNB
gnb = GaussianNB()
gnb = gnb.fit(features_train,labels_train)
print gnb.score(features_train,labels_train)
print gnb.score(features_test,labels_test)

0.793911007026
0.743859649123